[
  {
    "id": 1,
    "name": "Ada Lovelace",
    "field": "Mathematician",
    "imageWhite": "ada_lovelace",
    "imageGreen": "ada_lovelace_g",
    "birth": "December 10, 1815, England",
    "death": "November 27, 1852, England",
    "achievement": "Creator of the first computer program",
    "biography": "Ada Lovelace, born Augusta Ada Byron, was the daughter of the poet Lord Byron and Anne Isabella Milbanke. Despite her aristocratic background, she developed a deep passion for mathematics and logic at a young age, which was nurtured by her mother as a way to prevent her from inheriting her father's perceived madness. Her most significant contribution came from her collaboration with Charles Babbage on his Analytical Engine, a proposed mechanical general-purpose computer. In 1843, she translated an Italian article about the machine and added extensive notes of her own, which included a detailed method for calculating a sequence of Bernoulli numbers. This is now recognized as the first published algorithm designed for implementation on a computer, making her the world's first computer programmer.",
    "whyInspiring": "Ada Lovelace stands as a timeless symbol of visionary thinking. She imagined computers not merely as number-crunchers, but as tools capable of creating music, art, and complex decision-making processes—long before such applications were even conceivable. At a time when women's roles in science were barely acknowledged, she carved her place in history through intellect and curiosity. Her legacy continues to inspire generations of women to pursue careers in STEM and to see themselves as both analytical and creative pioneers."
  },
  {
      "id": 2,
      "name": "Kateryna Yushchenko",
      "field": "Computer Scientist",
      "imageWhite": "kateryna_yushchenko",
      "imageGreen": "kateryna_yushchenko_g",
      "birth": "December 8, 1919, Ukraine",
      "death": "August 15, 2001, Ukraine",
      "achievement": "Designed Address – one of the world's first high-level programming languages",
      "biography": "Kateryna Yushchenko was a pioneering Ukrainian computer scientist who endured Stalinist repression yet earned her PhD in physical and mathematical sciences. In 1955, she created Address, a high-level language enabling indirect addressing (pointers) and programming early Soviet-era computers like MESM. She became the first woman in the USSR to earn such a doctorate and led the Institute of Computer Science.",
      "whyInspiring": "Despite personal and political hardship—including her parents’ arrests and expulsion from university—Yushchenko persevered to revolutionize programming. She introduced foundational concepts like indirect addressing long before they appeared in Western languages. Her resilience and intellectual breakthroughs paved the way for women in Eastern European science and computer engineering."
    },
  {
    "id": 3,
    "name": "Grace Hopper",
    "field": "Computer Scientist",
    "imageWhite": "grace_hopper",
    "imageGreen": "grace_hopper_g",
    "birth": "December 9, 1906, USA",
    "death": "January 1, 1992, USA",
    "achievement": "Invented the first compiler and contributed to the COBOL language",
    "biography": "Grace Hopper was an American computer scientist and United States Navy rear admiral. She earned a Ph.D. in mathematics from Yale and went on to become a pioneer of computer programming. During World War II, she joined the Navy and was assigned to the Harvard Mark I project. She developed the first compiler, a program that translates written code into machine language, which laid the groundwork for the development of high-level programming languages like COBOL. Hopper was known for her advocacy of user-friendly programming languages and her belief in the power of computing to transform society.",
    "whyInspiring": "Grace Hopper broke through both gender and academic barriers in a male-dominated field. She not only innovated on a technical level but also changed perceptions about what computers could do and who could program them. Her service in the Navy and her passion for education helped foster generations of future computer scientists. Her legacy is still felt through the annual Grace Hopper Celebration of Women in Computing."
  },
  {
    "id": 4,
    "name": "Katherine Johnson",
    "field": "Mathematician / Space Scientist",
    "imageWhite": "katherine_johnson",
    "imageGreen": "katherine_johnson_g",
    "birth": "August 26, 1918, USA",
    "death": "February 24, 2020, USA",
    "achievement": "Calculated trajectories for NASA missions, including Apollo 11",
    "biography": "Katherine Johnson was an African-American mathematician whose work was crucial to the success of early space missions at NASA. She was one of the first African-American women to work as a scientist at the space agency, breaking both racial and gender barriers. Johnson calculated flight paths, launch windows, and emergency return trajectories for many missions, including John Glenn's orbital mission and the Apollo 11 moon landing. Her story gained wider recognition through the book and movie 'Hidden Figures'.",
    "whyInspiring": "Katherine Johnson demonstrated extraordinary intellectual ability and determination in an era when systemic racism and sexism were widespread. Her commitment to excellence and perseverance paved the way for countless women and minorities in STEM. Her story is a powerful reminder that talent can overcome barriers when given the opportunity to shine."
  },
  {
    "id": 5,
    "name": "Frances E. Allen",
    "field": "Computer Scientist",
    "imageWhite": "frances_allen",
    "imageGreen": "frances_allen_g",
    "birth": "August 4, 1932, USA",
    "death": "August 4, 2020, USA",
    "achievement": "Pioneered compiler optimization; first female Turing Award winner",
    "biography": "Frances Elizabeth Allen was a pioneering computer scientist who made fundamental contributions to compiler technology and program optimization. Joining IBM in 1957, she worked on the development of compilers that translate high-level programming languages into efficient machine code. Her research improved program execution speed and resource use, foundational to modern computing performance. In 2006, she became the first woman to receive the Turing Award for her groundbreaking work. Allen was also a mentor and advocate for women in computing throughout her long career.",
    "whyInspiring": "Frances Allen’s trailblazing career dismantled barriers in computer science, both through her technical contributions and as a role model. Her work enabled computers to run faster and more efficiently, impacting countless applications and systems worldwide. By winning the Turing Award, she shattered a glass ceiling in a field historically dominated by men. Her dedication to mentoring and advocating for diversity in tech continues to inspire new generations to pursue computer science and contribute to its advancement with confidence and resilience."
  },
   {
        "id": 6,
        "name": "Margaret Hamilton",
        "field": "Software Engineer",
        "imageWhite": "margaret_hamilton",
        "imageGreen": "margaret_hamilton_g",
        "birth": "August 17, 1936, USA",
        "death": null,
        "achievement": "Led the development of the onboard flight software for NASA's Apollo missions",
        "biography": "Margaret Hamilton was the director of the Software Engineering Division at the MIT Instrumentation Laboratory, where she led the team that developed the onboard flight software for NASA’s Apollo space missions. Her pioneering work introduced rigorous software engineering principles at a time when the discipline was still emerging. The reliability and robustness of her software were crucial for the success of the Apollo 11 moon landing, as it helped the spacecraft’s computer prioritize critical tasks and recover from errors in real-time. Hamilton’s work laid the foundation for modern software engineering practices and demonstrated that software is an integral and vital part of system design.",
        "whyInspiring": "Margaret Hamilton’s leadership in creating fault-tolerant software for the Apollo missions fundamentally changed how engineers approach software development. She championed the importance of software reliability and pioneered the term 'software engineering,' elevating it from an ad hoc process to a formal discipline. At a time when women were rare in tech leadership, she commanded a team that delivered mission-critical systems under extreme pressure. Hamilton’s legacy inspires technologists to innovate with precision and care, emphasizing that quality software can save lives and push the boundaries of human achievement."
      },
      {
        "id": 7,
        "name": "Susan Kare",
        "field": "Graphic Designer / Interface Designer",
        "imageWhite": "susan_kare",
        "imageGreen": "susan_kare_g",
        "birth": "February 5, 1954, USA",
        "death": null,
        "achievement": "Designed iconic user interface graphics for Apple Macintosh",
        "biography": "Susan Kare is a pioneering graphic designer whose work defined the look and feel of early personal computing. She designed many of the original Macintosh’s graphical user interface elements, including icons like the 'Happy Mac,' the trash can, and the command symbol. Her designs helped make computers more approachable and user-friendly by creating a visual language that communicated function intuitively. Kare’s career spans work for Apple, Microsoft, and other tech giants, where her focus on human-centered design has helped shape how millions interact with technology.",
        "whyInspiring": "Susan Kare’s work reminds us that technology is not just about hardware and code, but about human experience. By crafting intuitive, friendly icons, she bridged the gap between complex machines and everyday users, making technology accessible to all. Her artistry combined with technical understanding exemplifies the powerful role of design in innovation. As a woman in a largely male field, Kare’s success emphasizes that diverse perspectives improve technology’s usability and reach. She inspires designers and technologists alike to create with empathy, creativity, and a deep respect for users."
      },
      {
        "id": 8,
        "name": "Sophie Wilson",
        "field": "Computer Architect",
        "imageWhite": "sophie_wilson",
        "imageGreen": "sophie_wilson_g",
        "birth": "June 1, 1957, United Kingdom",
        "death": null,
        "achievement": "Co-designed the ARM architecture, widely used in mobile devices",
        "biography": "Sophie Wilson is a pioneering computer scientist and engineer best known for designing the BBC Micro computer and co-developing the ARM architecture—the processor design that powers billions of mobile and embedded devices worldwide. Starting her career in the early 1980s, Wilson focused on creating efficient, compact, and energy-saving processors. The ARM design revolutionized the tech industry by enabling powerful computing in small, battery-operated devices. Wilson’s work continues to influence modern computing, and she has received numerous awards recognizing her innovations and impact.",
        "whyInspiring": "Sophie Wilson’s work exemplifies how focused engineering and visionary thinking can transform entire industries. By designing processors that combined power efficiency with high performance, she helped democratize computing and empower mobile technology. Beyond technical brilliance, Wilson’s career as an openly transgender woman in tech highlights the importance of diversity, authenticity, and resilience. Her journey inspires technologists to innovate thoughtfully, challenge norms, and foster inclusive environments where all can contribute their best ideas."
      },
      {
        "id": 9,
        "name": "Shafi Goldwasser",
        "field": "Cryptographer",
        "imageWhite": "shafi_goldwasser",
        "imageGreen": "shafi_goldwasser_g",
        "birth": "February 4, 1958, USA",
        "death": null,
        "achievement": "Turing Award-winning work in cryptography and computational complexity",
        "biography": "Shafi Goldwasser is a world-renowned computer scientist specializing in cryptography, zero-knowledge proofs, and complexity theory. Her groundbreaking research laid the foundation for secure digital communication and privacy-preserving technologies. Goldwasser’s contributions have been critical in developing modern encryption systems that protect everything from financial transactions to personal communications. She is a professor at MIT and the Weizmann Institute of Science, and she has received numerous awards including the prestigious Turing Award, often called the 'Nobel Prize of Computing.'",
        "whyInspiring": "Shafi Goldwasser’s work safeguards the privacy and security of the digital world, a mission that grows more vital every day. Her research into zero-knowledge proofs introduced ways to verify information without revealing the information itself, revolutionizing how we think about trust and security online. As a female leader in theoretical computer science—a field with even fewer women—Goldwasser exemplifies brilliance, dedication, and the power of intellectual rigor. She inspires aspiring scientists to push boundaries in pursuit of a safer, more private digital future."
      },
      {
        "id": 10,
        "name": "Ginni Rometty",
        "field": "Technology Executive",
        "imageWhite": "ginni_rometty",
        "imageGreen": "ginni_rometty_g",
        "birth": "July 29, 1957, Chicago, Illinois",
        "death": null,
        "achievement": "First female CEO of IBM; led company through cloud and AI transformation",
        "biography": "Virginia 'Ginni' Rometty was the first woman to serve as CEO of IBM, a position she held from 2012 to 2020. Under her leadership, IBM shifted focus toward cloud computing, artificial intelligence, and data analytics, transforming its business model for the digital era. Rometty championed innovation, workforce diversity, and strategic acquisitions that positioned IBM as a leader in emerging technologies. She is recognized for her commitment to STEM education and expanding opportunities for women and minorities in tech.",
        "whyInspiring": "Ginni Rometty’s tenure as IBM’s CEO exemplifies visionary leadership in a highly competitive and evolving industry. Breaking through gender barriers at the helm of a global tech giant, she steered IBM’s reinvention with bold strategy and resilience. Her focus on ethical AI, workforce development, and inclusion reflects a holistic approach to corporate responsibility. Rometty’s journey inspires leaders to combine innovation with empathy, proving that diverse leadership drives sustainable success and positive societal impact."
      },
      {
        "id": 11,
        "name": "Fei-Fei Li",
        "field": "Artificial Intelligence Researcher",
        "imageWhite": "fei_fei_li",
        "imageGreen": "fei_fei_li_g",
        "birth": "November 13, 1976, China",
        "death": null,
        "achievement": "Co-creator of ImageNet, revolutionizing computer vision and deep learning",
        "biography": "Fei-Fei Li is a prominent computer scientist known for her pioneering work in artificial intelligence and computer vision. As a professor at Stanford University and former chief scientist of AI/ML at Google Cloud, she led the creation of ImageNet, a massive annotated image dataset that became the foundation for advances in deep learning and object recognition. Her research has propelled AI from academic theory to real-world applications impacting medicine, robotics, and more. Li is also a passionate advocate for diversity and ethics in AI, emphasizing human-centered technology development.",
        "whyInspiring": "Fei-Fei Li’s visionary leadership has transformed AI from niche research to a global technological revolution. By spearheading ImageNet, she provided the essential data that fueled breakthroughs in machine learning, enabling computers to understand images and videos with unprecedented accuracy. Her commitment to ethical AI and inclusion highlights the importance of responsible innovation that benefits all people. As a woman and immigrant in tech, Li’s journey inspires those who face obstacles to pursue bold ideas, build community, and drive AI toward a better future."
      },
      {
        "id": 12,
        "name": "Reshma Saujani",
        "field": "Entrepreneur / Advocate",
        "imageWhite": "reshma_saujani",
        "imageGreen": "reshma_saujani_g",
        "birth": "November 18, 1975, USA",
        "death": null,
        "achievement": "Founder of Girls Who Code, closing the gender gap in technology",
        "biography": "Reshma Saujani is an entrepreneur, author, and advocate who founded Girls Who Code in 2012, a nonprofit organization dedicated to closing the gender gap in technology. With a background in law and public service, she recognized the need to encourage young girls to pursue computer science and coding skills. Girls Who Code has since reached hundreds of thousands of girls worldwide, providing education, mentorship, and community support. Saujani is also a bestselling author and speaker who promotes bravery and resilience, encouraging girls to embrace failure as part of growth.",
        "whyInspiring": "Reshma Saujani’s work embodies empowerment through education and community-building. By creating spaces where girls can learn coding and leadership skills, she addresses systemic gender disparities in tech. Her emphasis on 'teaching girls to be brave, not perfect' challenges cultural norms and fosters confidence in young women. Saujani’s visionary leadership shows how advocacy and innovation can intersect to create lasting societal change, inspiring a generation to redefine who belongs in technology and how they get there."
      },
      {
        "id": 13,
        "name": "Timnit Gebru",
        "field": "AI Ethics Researcher",
        "imageWhite": "timnit_gebru",
        "imageGreen": "timnit_gebru_g",
        "birth": "1983, Ethiopia",
        "death": null,
        "achievement": "Pioneering research in AI bias, co-leader of Google's ethical AI team",
        "biography": "Timnit Gebru is a computer scientist known for her work on algorithmic bias, fairness, and ethics in artificial intelligence. Co-founder of the Black in AI affinity group, she has been a vocal advocate for transparency and accountability in AI systems. Gebru's research has highlighted racial and gender biases in facial recognition and large language models, pushing the industry toward more ethical practices. Her leadership roles include co-leading Google’s Ethical AI team before her high-profile departure sparked global discussions on ethics and corporate governance in tech.",
        "whyInspiring": "Timnit Gebru’s courage and scholarship challenge the AI community to confront uncomfortable truths about bias and inequality embedded in technology. Her advocacy for marginalized voices in AI research and insistence on ethical responsibility spotlight the societal consequences of unchecked innovation. Gebru’s experience highlights the importance of speaking truth to power and fighting for inclusivity and justice within the tech industry. She inspires researchers and activists to hold technology accountable and work towards AI that respects human dignity and fairness."
      },
      {
        "id": 14,
        "name": "Whitney Wolfe Herd",
        "field": "Entrepreneur",
        "imageWhite": "whitney_wolfe_herd",
        "imageGreen": "whitney_wolfe_herd_g",
        "birth": "July 1, 1989, USA",
        "death": null,
        "achievement": "Founder and CEO of Bumble; youngest female CEO to take a company public",
        "biography": "Whitney Wolfe Herd is a technology entrepreneur and the founder of Bumble, a dating app that empowers women to make the first move. Launched in 2014, Bumble grew rapidly by promoting respectful, female-friendly online interactions and has expanded into social networking and professional connections. In 2021, Wolfe Herd became the youngest female CEO to take a company public, making her one of the most prominent women leaders in tech and business. She is known for advocating gender equality and challenging norms in the tech startup world.",
        "whyInspiring": "Whitney Wolfe Herd’s entrepreneurial success redefines leadership and gender dynamics in the technology sector. By creating a platform that centers women’s agency and safety, she disrupted a crowded industry and championed inclusivity. Taking Bumble public as a young female CEO broke glass ceilings and sent a powerful message about female leadership in tech and finance. Her story inspires entrepreneurs to innovate with purpose, challenge entrenched biases, and lead authentically in shaping digital culture."
      },
      {
        "id": 15,
        "name": "Joy Buolamwini",
        "field": "Computer Scientist / Activist",
        "imageWhite": "joy_buolamwini",
        "imageGreen": "joy_buolamwini_g",
        "birth": "January 23, 1990, Canada",
        "death": null,
        "achievement": "Founder of the Algorithmic Justice League, advocating against bias in AI",
        "biography": "Joy Buolamwini is a computer scientist and digital activist who uncovered racial and gender biases in facial recognition technologies. Her research revealed that many AI systems perform poorly on darker-skinned and female faces, raising concerns about fairness and discrimination. She founded the Algorithmic Justice League to combat these biases and promote accountability in AI development. Buolamwini’s work has influenced tech companies, policymakers, and the public to recognize and address ethical challenges in artificial intelligence.",
        "whyInspiring": "Joy Buolamwini’s courage in confronting the ethical blind spots of AI has sparked a vital conversation about technology’s societal impacts. By shining light on bias embedded in algorithms, she advocates for fairness, transparency, and inclusion in a rapidly evolving field. Her activism exemplifies how technical expertise combined with social consciousness can drive meaningful change. Buolamwini inspires technologists and activists alike to hold powerful technologies accountable, ensuring that AI empowers rather than marginalizes diverse communities."
      }
    ]
